latex/getting_started.tex
\chapter{Appendix: Getting Started}

In this section, we will build the most ontology and start to show the
basic capabilities of Tawny-OWL.

As described in \label{/the/environment-the-environment}, Tawny-OWL can be
used with several different toolchains. In this section, we will run
through the building a very simple ontology. There is an section describing
how to achieve each of these steps with specific tool chains.

\subsection{Getting a Project}
\label{sec-4-1}

For this book, we will use a pre-rolled project -- in fact the one used
to create this book. You can access the project data from
\url{https://github.com/phillord/take-wing[github}], either using \texttt{git} or
through the download option. If you wish to know how to build a project
yourself, please read <>.

A leiningen project is, essentially, a directory structure with a
project file. The \texttt{project.clj} file for this book looks like this:

\begin{clojure}
(defproject take-wing "0.1.0-SNAPSHOT"
  :dependencies [[uk.org.russet/tawny-owl "1.1.1-SNAPSHOT"]])
\end{clojure}

This includes three critical pieces of information. Firstly \texttt{take-wing}
which is the name of the project. Secondly, immediately after this is a
version number such as \texttt{0.1.0}. Finally, we have a \texttt{:dependencies} which
includes only a single dependency to \texttt{tawny-owl} itself.


\subsection{Starting a new ontology}
\label{sec-4-2}

It is possible to build an ontology in Tawny-OWL using almost no
functions from Clojure, the language on which it is built; the only
necessary exception to this is the \emph{namespace declaration}.

Like most programming languages, Clojure has a namespacing mechanism.
These are declared at the start of each file, and the namespace relates
to the file name and location. Finally, the namespace form is also used
to import functions from other namespaces. Here, we define a namespace
called \texttt{take.wing.getting-started} which would be defined in a file
\texttt{take/wing/getting\_started.clj}. Secondly, we import \texttt{tawny.owl}
namespace which contains the core functions of Tawny-OWL.

\begin{tawny}
(ns take.wing.getting-started (:use [tawny.owl]))
\end{tawny}

Tawny-OWL also uses the namespace mechanism to define the scope of an
ontology. In general, an ontology is defined within a single namespace,
and each namespace defines a single ontology. A new ontology is declared
with the \texttt{defontology} form. This also introduces a new symbol, \texttt{pizza},
which can be used latter to refer.

\begin{tawny}
(defontology pizza)
\end{tawny}


\subsection{Connecting to a repl}
\label{sec-4-3}

Currently, the source for the ontology has been created, but this is not
"live" -- for this, we must start a Clojure process and connect to it
via a REPL and then evaluate the file. With the current contents, the
REPL should show something like the following which is the result of
evaluating the last form, and shows that we have defined a new symbol
footnote:[In Clojure, it is actually a var that has been created]

\begin{verbatim}
=> #'take.wing.getting-started/pizza
\end{verbatim}

The symbol \texttt{pizza} now refers to an object live in the system. If
evalulate \texttt{pizza}, a hopefully informative string message will be
printed.


\begin{verbatim}
take.wing.getting-started> pizza
#<OWLOntologyImpl Ontology(OntologyID(OntologyIRI(<#pizza>))) [Axioms: 0 Logical Axioms: 0]>
\end{verbatim}


\subsection{Creating some entities}
\label{sec-4-4}

Now we create some entities for our ontology, in this case two classes
called |Pizza| and \texttt{MargheritaPizza}, and state that \texttt{MargheritaPizza}
is a subclass of \texttt{Pizza}. This forms implicitly place these two terms


\begin{tawny}
(defclass Pizza)
(defclass MargheritaPizza :super Pizza)
\end{tawny}

Finally, we are in a position to make a useful query against this which
we can do using the \texttt{subclasses} function.

\begin{tawny}
(subclasses Pizza)
\end{tawny}

In a REPL session, this returns a set with one element ---
\texttt{MargheritaPizza}. If we evaluate \texttt{pizza} (the ontology) again, we also
see that the ontology now has a number of axioms.


\begin{verbatim}
(subclasses Pizza)
#{#<OWLClassImpl <#pizza#MargheritaPizza>>}
take.wing.getting-started> pizza
=> #<OWLOntologyImpl Ontology(OntologyID(OntologyIRI(<#pizza>))) [Axioms: 5 Logical Axioms: 1]>
\end{verbatim}


\subsection{Summary}
\label{sec-4-5}

In this section, we have outlined the basic tasks that are needed to
build ontologies with Tawny-OWL: creating a project, creating an
ontology, creating some entities. We have also started to show how to
use and query over them. In the next section, we will build this
ontology in full, using it to demonstrate many parts of Tawny-OWL and
OWL ontologies in general.

